# Opportunity Youth in South King County updated for 2019

## Import Necessary Packages

In [9]:
from sqlalchemy import create_engine
import pandas as pd

## Load Data from postgresQL database into Pandas DataFrame

In [3]:
engine = create_engine("postgresql:///opportunity_youth")

The following query selects all columns from the `pums_2017` database filtered by rows that meet the qualifications for South King County opportunity youth (i.e., ages 16-24 and neither currently enrolled nor employed).

In [7]:
query = "SELECT * FROM pums_2017 WHERE (rt = 'P') AND (puma = '11610' OR puma = '11613' OR puma = '11614' OR puma = '11615' OR puma = '11611' OR puma = '11612') AND (agep BETWEEN 16 AND 24) AND (sch = '1') AND (esr = '3' OR esr = '6')"

In [14]:
opp_youth = pd.read_sql(sql = query, con = engine) #read table query into Pandas DataFrame

In [11]:
opp_youth.head()

,rt,serialno,division,sporder,puma,region,st,adjinc,pwgtp,agep,...,pwgtp71,pwgtp72,pwgtp73,pwgtp74,pwgtp75,pwgtp76,pwgtp77,pwgtp78,pwgtp79,pwgtp80
0,P,2013000030421,9,02,11611,4,53,1061971,11.0,19.0,...,16.0,12.0,10.0,9.0,9.0,10.0,13.0,11.0,10.0,10.0
1,P,2013000047506,9,04,11615,4,53,1061971,5.0,20.0,...,1.0,6.0,6.0,7.0,5.0,2.0,4.0,1.0,6.0,1.0
2,P,2013000048962,9,05,11612,4,53,1061971,25.0,22.0,...,7.0,37.0,24.0,44.0,26.0,7.0,25.0,9.0,39.0,7.0
3,P,2013000057563,9,05,11611,4,53,1061971,20.0,21.0,...,6.0,7.0,24.0,23.0,6.0,33.0,19.0,33.0,33.0,18.0
4,P,2013000058010,9,02,11614,4,53,1061971,45.0,17.0,...,20.0,56.0,51.0,39.0,40.0,52.0,17.0,48.0,51.0,54.0

## Estimating Opportunity Youth

The estimate of 2019 opportunity youth is calculated by summing all the records, but each record is multiplied by the column `pwgtp` which is the weight that record holds for the total population. Here, if we sum `pwgtp` across all the rows, we get an estimate of the opportunity youth in South King County.

In [13]:
opp_youth_est = opp_youth['pwgtp'].sum()
print(opp_youth_est)

10614.0

## Calculating Opportunity Youth Status by Age

The 2016 report on opportunity youth contains a breakdown of opportunity youth and total youth by age, their education status, and their employment status. Here, we recalculate these statistics using the updated information.

In [32]:
query16_18 = "SELECT SUM(CAST(pwgtp AS BIGINT)) FROM pums_2017 WHERE (rt = 'P') AND (puma = '11610' OR puma = '11613' OR puma = '11614' OR puma = '11615' OR puma = '11611' OR puma = '11612') AND (agep BETWEEN 16 AND 18)"

In [35]:
all_youth_16_18 = pd.read_sql(sql = query16_18, con = engine)

In [36]:
all_youth_16_18

       sum
0  30141.0